<!DOCTYPE html>
<html>
<!-- Created by GNU Texinfo 7.1, https://www.gnu.org/software/texinfo/ -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<title>Package operator_algebra: A Tool for Operator Manipulation in Maxima.</title>

<meta name="description" content="Package operator_algebra: A Tool for Operator Manipulation in Maxima.">
<meta name="keywords" content="Package operator_algebra: A Tool for Operator Manipulation in Maxima.">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta name="viewport" content="width=device-width,initial-scale=1">

<style type="text/css">
<!--
a.copiable-link {visibility: hidden; text-decoration: none; line-height: 0em}
div.example {margin-left: 3.2em}
span:hover a.copiable-link {visibility: visible}
strong.def-name {font-family: monospace; font-weight: bold; font-size: larger}
-->
</style>


</head>

<body lang="en">

<div class="chapter-level-extent" id="Package-operator_005falgebra">
<h2 class="chapter"><span>1 Package operator_algebra<a class="copiable-link" href="#Package-operator_005falgebra"> &para;</a></span></h2>


<ul class="mini-toc">
<li><a href="#Introduction-to-package-operator_005falgebra" accesskey="1">Introduction to package operator_algebra</a></li>
<li><a href="#Installation" accesskey="2">Installation</a></li>
<li><a href="#Basic-usage" accesskey="3">Basic usage</a></li>
<li><a href="#Functions-and-Variables-for-operator_005falgebra" accesskey="4">Functions and Variables for operator_algebra</a></li>
</ul>
<div class="section-level-extent" id="Introduction-to-package-operator_005falgebra">
<h3 class="section"><span>1.1 Introduction to package operator_algebra<a class="copiable-link" href="#Introduction-to-package-operator_005falgebra"> &para;</a></span></h3>

<p>The operator_algebra package provides support for working with operators, particularly
quantum mechanical operators. In the context of this package, an operator is a linear 
function, but mathematical the necessities, such as the specifying domains and codomains, is
not supported.
</p>
<p>As one application of this package, with a bit of programming, this package can do tasks such as 
normally order quantum creation and annihilation operators.
</p>
</div>
<div class="section-level-extent" id="Installation">
<h3 class="section"><span>1.2 Installation<a class="copiable-link" href="#Installation"> &para;</a></span></h3>

<p>To install the C:/maxima/operator_algebra/*, copy the folder <samp class="file">operator_algebra</samp> to a location that Maxima
can find. Alternatively, you can append the path to the folder <samp class="file">operator_algebra</samp> by pushing new 
terms onto the lists <code class="code">file_search_maxima</code> and <code class="code">file_search_lisp</code>; for example, if you copy
the operator_algebra package to the path &quot;C:/maxima/operator_algebra/*&quot;, put the commands
</p><div class="example">
<pre class="example-preformatted"> push(&quot;C:/maxima/operator_algebra/*.mac&quot;, file_search_maxima);
 push(&quot;C:/maxima/operator_algebra/*.lisp&quot;, file_search_lisp);
</pre></div>
<p>into your Maxima initialization file. Doing so will allow Maxima to load the package operator_algebra.
</p>
<p>To use the package, you must manually load it, the package does not autoload. Loading the package is done 
with the command
</p><div class="example">
<pre class="example-preformatted">(%i1)  load(&quot;operator_algebra&quot;)$
</pre></div>
<p>To run the regression tests for the package, issue the command
</p><div class="example">
<pre class="example-preformatted">(%i2) batch(&quot;rtest_operator_algebra&quot;, 'test)$
</pre></div>

</div>
<div class="section-level-extent" id="Basic-usage">
<h3 class="section"><span>1.3 Basic usage<a class="copiable-link" href="#Basic-usage"> &para;</a></span></h3>

<p>Function composition of operators is denoted by <code class="code">&quot;.&quot;</code>, Maxima&rsquo;s generic noncommutative 
multiplication operator; and the composition of an operator with itself is denoted by <code class="code">&quot;^^&quot;</code>,
Maxima&rsquo;s generic noncommutative exponentiation operator. As such, the settings of the option
variables <code class="code">dot0nscsimp, dot1simp, dot0simp,  dot1simp,  dotassoc,  dotconstrules, dotdistrib,
dotexptsimp,  dotident</code>, and <code class="code"> dotscrules</code> can alter the way Maxima simplifies compositions of 
operators.
</p>
<p>To declare that <code class="code">f</code> and <code class="code">g</code> are operators, these symbols must be declared. The package
defines <code class="code">operator</code> to be a feature, so we can declare <code class="code">f</code> and <code class="code">g</code> to be operators
and <code class="code">α</code> and <code class="code">β</code> to be constant using
</p>
<div class="example">
<pre class="example-preformatted">(%i1)	declare([f,g],operator)$
(%i2)	declare([α,β], constant)$
</pre></div>

<p>Now we can compute some commutators:
</p>
<div class="example">
<pre class="example-preformatted">(%i3)	commutator(α*f, β*g);
(%o3)	α*β*(f . g)-α*β*(g . f)

(%i4)	commutator(f, f);
(%o4)	0

(%i5)	commutator(f,f^^2);
(%o5)	0

(%i6)	commutator(f + g, g);
(%o6)	-(g . (g+f))+g^^2+f . g

(%i7)	expand(%);
(%o7)	f . g - g . f
</pre></div>
<p>In the last example, we see that a user must sometimes manually use <code class="code">expand</code> to fully 
simplify operators. As an alternative to manually expanding, a user can set the value
of the option variable <code class="code">dotdistrib</code> to true:
</p>
<div class="example">
<pre class="example-preformatted">(%i8)	block([dotdistrib : true], commutator(f +g, g));
(%o8)	f . g - g . f
</pre></div>

<p>We can give an operator a formula by using <code class="code">put</code>. For example, to define an operator <code class="code">Dx</code>
that differentiates with respect to <code class="code">x</code> and an operator <code class="code">X</code> that multiplies an expression
by <code class="code">X</code>, we first need to declare <code class="code">Dx</code> and <code class="code">X</code> to be operators; after that we can
define formulas for them using <code class="code">put</code>:
</p>
<div class="example">
<pre class="example-preformatted">(%i1)	declare(Dx, operator, X, operator)$

(%i2)	put(Dx, lambda([q], diff(q,x)), 'formula);
(%o2)	lambda([q],'diff(q,x,1))

(%i3)	put(X, lambda([q],  x*q), 'formula);
(%o3)	lambda([q],x*q)
</pre></div>
<p>The function <code class="code">operator_apply</code> applies a function to an argument:
</p><div class="example">
<pre class="example-preformatted">(%i4)	operator_apply(Dx, x^2);
(%o4)	Dx(x^2)
</pre></div>
<p>To use the formula for <code class="code">Dx</code>, use the function <code class="code">operator_express</code>:
</p><div class="example">
<pre class="example-preformatted">(%i5)	operator_express(%);
(%o5)	2*x
</pre></div>
<p>Finally, an example that uses both operators <code class="code">Dx</code> and <code class="code">X</code>:
</p><div class="example">
<pre class="example-preformatted">(%i6)	operator_apply(X.Dx.X, x^2);
(%o6)	X(Dx(X(x^2)))

(%i7)	operator_express(%);
(%o7)	3*x^3
</pre></div>

<p>In output %o6 above, we see that <code class="code">operator_apply</code> effectively changes the dotted notation
for function composition (in this case <code class="code">X.Dx.X</code>) to traditional parenthesized function
notation <code class="code">X(Dx(X(x^2)))</code>. The traditional notation allows us to use the <code class="code">simplifying</code>
package to define an operator as a simplifying function. (The source code for the <code class="code">simplifying</code>
package has some user documentation and some examples, but there is no other documentation for
this package.)
</p>
<p>We start by loading the <code class="code">simplifying</code> and defining predicates that detect if the main operator
of an expression is <code class="code">Dx</code> or <code class="code">X</code>. 
</p><div class="example">
<pre class="example-preformatted">(%i1)	load(simplifying)$
(%i2)	Dx_p(e) := not mapatom(e) and inpart(e,0) = 'Dx$
(%i3)	X_p(e) := not mapatom(e) and inpart(e,0) = 'X$
</pre></div>
<p>After that, we can define a simplification function for <code class="code">Dx</code> that applies the rule 
<code class="code"> Dx . X = Dx + X.Dx</code> that moves all the derivative operators to the right of all 
multiplication operators <code class="code">X</code>; our code is
</p><div class="example">
<pre class="example-preformatted">(%i4)	simp_Dx (e) := block([],
	    /* Dx . X = Dx + X.Dx */
	    if X_p(e) then (
	        Dx(first(e)) + X(Dx(first(e))))
	   else simpfuncall(Dx,e))$
	    
(%i5)	simplifying('Dx, 'simp_Dx)$

</pre></div>
<p>Some simple examples
</p><div class="example">
<pre class="example-preformatted">(%i6)	operator_simp(Dx .X);
(%o6)	X . Dx+Dx

(%i7)	block([dotdistrib : true], operator_simp(Dx . X^^2 - X^^2 . Dx));
(%o7)	2*(X . Dx)+Dx
</pre></div>

</div>
<div class="section-level-extent" id="Functions-and-Variables-for-operator_005falgebra">
<h3 class="section"><span>1.4 Functions and Variables for operator_algebra<a class="copiable-link" href="#Functions-and-Variables-for-operator_005falgebra"> &para;</a></span></h3>

<h3 class="heading" id="Predicates"><span>Predicates<a class="copiable-link" href="#Predicates"> &para;</a></span></h3>
<p>The <code class="code">operator_algebra</code> package defines a predicate <code class="code">operatorp</code> for detecting if a symbol is a declared operator as well
as five general purpose predicates <code class="code">exptp, ncexptp, nctimesp, timesp</code>, and <code class="code">plusp</code> that return <code class="code">true</code> if and
only if the main operator of a Maxima expression is <code class="code">^, ^^, .,</code> and <code class="code">+</code>, respectively.
</p>
<dl class="first-deffn">
<dt class="deffn" id="index-exptp"><span class="category-def">Function: </span><span><strong class="def-name">exptp</strong> <var class="def-var-arguments">(<code class="code">e</code>)</var><a class="copiable-link" href="#index-exptp"> &para;</a></span></dt>
<dd>
<p>The function call <code class="code">exptp(e)</code> returns true if the operator of the expression <code class="code">e</code> is 
<code class="code">^</code>; otherwise it returns false. The main operator of an expression is determined by the Maxima function <code class="code">inpart</code>, not <code class="code">part</code>.
</p></dd></dl>

<p><strong class="strong">Examples</strong>
</p>
<div class="example">
<pre class="example-preformatted">(%i1)	exptp(x);
(%o1)	false

(%i2)	exptp(x^2);
(%o2)	true
</pre></div>


<dl class="first-deffn">
<dt class="deffn" id="index-ncexptp"><span class="category-def">Function: </span><span><strong class="def-name">ncexptp</strong> <var class="def-var-arguments">(<code class="code">e</code>)</var><a class="copiable-link" href="#index-ncexptp"> &para;</a></span></dt>
<dd>
<p>The function call <code class="code">ncexptp(e)</code> returns true if the operator of the expression <code class="code">e</code> is 
<code class="code">^^</code>; otherwise it returns false. The main operator of an expression is determined by the Maxima 
function <code class="code">inpart</code>, not <code class="code">part</code>.
</p></dd></dl>

<p><strong class="strong">Examples</strong>
</p>
<div class="example">
<pre class="example-preformatted">(%i1)	ncexptp(x^2);
(%o1)	false

(%i2)	ncexptp(x^^2);
(%o2)	true
</pre></div>

<dl class="first-deffn">
<dt class="deffn" id="index-nctimesp"><span class="category-def">Function: </span><span><strong class="def-name">nctimesp</strong> <var class="def-var-arguments">(<code class="code">e</code>)</var><a class="copiable-link" href="#index-nctimesp"> &para;</a></span></dt>
<dd>
<p>The function call <code class="code">nctimesp(e)</code> returns true if the operator of the expression <code class="code">e</code> is 
<code class="code">.</code>; otherwise it returns false. The main operator of an expression is determined by the Maxima 
function <code class="code">inpart</code>, not <code class="code">part</code>.
</p></dd></dl>

<p><strong class="strong">Examples</strong>
</p>
<div class="example">
<pre class="example-preformatted">(%i1)	nctimesp(x * y);
(%o1)	false

(%i2)	nctimesp(x . y);
(%o2)	true
</pre></div>

<dl class="first-deffn">
<dt class="deffn" id="index-timesp"><span class="category-def">Function: </span><span><strong class="def-name">timesp</strong> <var class="def-var-arguments">(<code class="code">e</code>)</var><a class="copiable-link" href="#index-timesp"> &para;</a></span></dt>
<dd>
<p>The function call <code class="code">timesp(e)</code> returns true if the operator of the expression <code class="code">e</code> is 
<code class="code">*</code>; otherwise it returns false. The main operator of an expression is determined by the Maxima 
function <code class="code">inpart</code>, not <code class="code">part</code>.
</p></dd></dl>

<p><strong class="strong">Examples</strong>
</p>
<div class="example">
<pre class="example-preformatted">(%i1)	timesp(x * y);
(%o1)	true

(%i2)	timesp(x . y);
(%o2)	false
</pre></div>

<dl class="first-deffn">
<dt class="deffn" id="index-plusp"><span class="category-def">Function: </span><span><strong class="def-name">plusp</strong> <var class="def-var-arguments">(<code class="code">e</code>)</var><a class="copiable-link" href="#index-plusp"> &para;</a></span></dt>
<dd>
<p>The function call <code class="code">plusp(e)</code> returns true if the operator of the expression <code class="code">e</code> is 
<code class="code">+</code>; otherwise it returns false. The main operator of an expression is determined by the Maxima 
function <code class="code">inpart</code>, not <code class="code">part</code>.
</p></dd></dl>

<p><strong class="strong">Examples</strong>
</p><div class="example">
<pre class="example-preformatted">(%i1)	plusp(1);
(%o1)	false

(%i2)	plusp(1+x);
(%o2)	true
</pre></div>

<h3 class="heading" id="Functions"><span>Functions<a class="copiable-link" href="#Functions"> &para;</a></span></h3>

<dl class="first-deffn">
<dt class="deffn" id="index-operator_005fadjoint"><span class="category-def">Function: </span><span><strong class="def-name">operator_adjoint</strong> <var class="def-var-arguments">(<code class="code">e</code>)</var><a class="copiable-link" href="#index-operator_005fadjoint"> &para;</a></span></dt>
<dd>
<p>The function call <code class="code">operator_adjoint (e)</code> returns the operator algebra adjoint of <code class="code">e</code>. In Quantum 
Mechanics, the adjoint is generally known as the <em class="emph">hermitian conjugate</em>.
</p>
</dd></dl>

<p>The operator adjoint of an operator returns an <code class="code">operator_adjoint</code> nounform:
</p><div class="example">
<pre class="example-preformatted">(%i1)	declare(F,operator,G, operator)$

(%i2)	operator_adjoint(F);
(%o2)	operator_adjoint(F)
</pre></div>

<p>The operator adjoint is and involution, that is the operator adjoint is its own inverse:
</p><div class="example">
<pre class="example-preformatted">(%i3)	operator_adjoint(%);
(%o3)	F
</pre></div>


<p>To tell Maxima, that the adjoint of <code class="code">F</code> is <code class="code">G</code>, use a <code class="code">put</code> statement:
</p><div class="example">
<pre class="example-preformatted">(%i4)	(put(F,G, operator_adjoint),put(G,F, operator_adjoint))$
</pre></div>

<p>The adjoint is additive
</p><div class="example">
<pre class="example-preformatted">(%i5)	operator_adjoint(2*F - 5*G);
(%o5)	2*G-5*F

(%i6)	operator_adjoint(P .Q);
(%o6)	Q . P

(%i7)	operator_adjoint(F^^2);
(%o7)	G^^2
</pre></div>

<p>The adjoint of a complex number is the complex conjugate of the number; for a matrix, 
it is the transpose of the element-wise adjoint of the matrix:
</p>
<div class="example">
<pre class="example-preformatted">(%i8)	operator_adjoint(2+%i);
(%o8)	2-%i
(%i11)	operator_adjoint(matrix([1,%i, 3],[4,5,6]));
(%o11)	matrix([1, 4], [-%i, 5], [3, 6])

(%i12)	operator_adjoint(matrix([0,F],[G,0]));
(%o12)	matrix([0, F], [G, 0])
</pre></div>

<dl class="first-deffn">
<dt class="deffn" id="index-dot_005fform"><span class="category-def">Function: </span><span><strong class="def-name">dot_form</strong> <var class="def-var-arguments">(<code class="code">e</code>)</var><a class="copiable-link" href="#index-dot_005fform"> &para;</a></span></dt>
<dd>
<p>The function call <code class="code">dot_form(e)</code> converts an expression <code class="code">e</code> from a parenthesized functional form to 
a &ldquo;dot form.&rdquo;
</p></dd></dl>

<p><em class="emph">Examples</em>
Assuming <code class="code">F</code> and <code class="code">G</code> are declared operators, we have 
</p>
<div class="example">
<pre class="example-preformatted">(%i1)	dot_form(F(G(x)));
(%o1)	F . G . x

(%i2)	dot_form(F(F(x)) - F(G(x)));
(%o2)	F^^2 . x-F . G . x
</pre></div>

<dl class="first-deffn">
<dt class="deffn" id="index-operatorp"><span class="category-def">Function: </span><span><strong class="def-name">operatorp</strong> <var class="def-var-arguments">(e)</var><a class="copiable-link" href="#index-operatorp"> &para;</a></span></dt>
<dd>
<p>The function call <code class="code">operatorp (e)</code> returns true if the input 
<code class="code">e</code> is a declared operator; otherwise it returns false.
</p>
</dd></dl>

<p><strong class="strong">Examples</strong>
</p><div class="example">
<div class="group"><pre class="example-preformatted">(%i1)	operatorp(q);
(%o1)	true

(%i2)	declare(q,operator);
(%o2)	done

(%i3)	operatorp(q);
(%o3)	true
</pre></div><pre class="example-preformatted">
The predicate <code class="code">operatorp</code> does <em class="emph">not</em> recognize linear combinations or compositions of operators to 
be an operator; for example

</pre><div class="group"><pre class="example-preformatted">(%i4)	operatorp(5*q);
(%o4)	false
</pre></div></div>

<dl class="first-deffn">
<dt class="deffn" id="index-commutator"><span class="category-def">Function: </span><span><strong class="def-name">commutator</strong> <var class="def-var-arguments">(<code class="code">f,g</code>)</var><a class="copiable-link" href="#index-commutator"> &para;</a></span></dt>
<dd>
<p>The function call <code class="code">commutator(f,g)</code> returns <code class="code">operator_simp(f.g - g.f)</code>. 
</p></dd></dl>



</div>
</div>



</body>
</html>
